#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```hcl
terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/stae1102-org/terraform-aws-tfc-workflow/runs/run-FwfqV3rLpKSnptEF

Waiting for the plan to start...

Terraform v1.6.5
on linux_amd64
Initializing plugins and modules...
tls_private_key.hashicat: Refreshing state... [id=850444e5fe67afaa9a6f2c3b44fb729c3fee88a3]
aws_key_pair.hashicat: Refreshing state... [id=stae1102-ssh-key.pem]
data.aws_ami.ubuntu: Refreshing...
aws_vpc.hashicat: Refreshing state... [id=vpc-08957f3a49972148c]
data.aws_ami.ubuntu: Refresh complete after 1s [id=ami-07ba757d6e39916a6]
aws_internet_gateway.hashicat: Refreshing state... [id=igw-0696bd5b35b9b7839]
aws_subnet.hashicat: Refreshing state... [id=subnet-0c9c479fc2ba47a98]
aws_security_group.hashicat: Refreshing state... [id=sg-0afc3a656042a8dff]
aws_route_table.hashicat: Refreshing state... [id=rtb-03a16de043f1f89a1]
aws_instance.hashicat: Refreshing state... [id=i-001dfccad00403f48]
aws_route_table_association.hashicat: Refreshing state... [id=rtbassoc-0b66c4cec8eabff4b]
aws_eip.hashicat: Refreshing state... [id=eipalloc-0799042df998ccfae]
aws_eip_association.hashicat: Refreshing state... [id=eipassoc-09697441d3ca18792]
null_resource.configure_cat_app: Refreshing state... [id=2156670416893226995]
aws_key_pair.hashicat: Drift detected (update)
aws_instance.hashicat: Drift detected (update)
aws_eip.hashicat: Drift detected (update)
aws_route_table.hashicat: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_eip.hashicat will be updated in-place
  ~ resource "aws_eip" "hashicat" {
        id                   = "eipalloc-0799042df998ccfae"
      ~ instance             = "i-001dfccad00403f48" -> (known after apply)
        tags                 = {}
        # (12 unchanged attributes hidden)
    }

  # aws_eip_association.hashicat must be replaced
-/+ resource "aws_eip_association" "hashicat" {
      ~ id                   = "eipassoc-09697441d3ca18792" -> (known after apply)
      ~ instance_id          = "i-001dfccad00403f48" # forces replacement -> (known after apply) # forces replacement
      ~ network_interface_id = "eni-01bd136c123b7988a" -> (known after apply)
      ~ private_ip_address   = "10.0.10.167" -> (known after apply)
      ~ public_ip            = "15.165.135.12" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_instance.hashicat must be replaced
-/+ resource "aws_instance" "hashicat" {
      ~ arn                                  = "arn:aws:ec2:ap-northeast-2:156401130715:instance/i-001dfccad00403f48" -> (known after apply)
      ~ availability_zone                    = "ap-northeast-2a" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 2 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-001dfccad00403f48" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ key_name                             = "stae1102-ssh-key.pem" -> "DEV-ssh-key.pem" # forces replacement
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-01bd136c123b7988a" -> (known after apply)
      ~ private_dns                          = "ip-10-0-10-167.ap-northeast-2.compute.internal" -> (known after apply)
      ~ private_ip                           = "10.0.10.167" -> (known after apply)
      ~ public_dns                           = "ec2-15-165-135-12.ap-northeast-2.compute.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "15.165.135.12" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
      ~ tags                                 = {
          ~ "Name" = "stae1102-hashicat-instance" -> "DEV-hashicat-instance"
        }
      ~ tags_all                             = {
          ~ "Name"    = "stae1102-hashicat-instance" -> "DEV-hashicat-instance"
            # (2 unchanged elements hidden)
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-0afc3a656042a8dff",
        ] -> (known after apply)
        # (7 unchanged attributes hidden)

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - cpu_options {
          - core_count       = 1 -> null
          - threads_per_core = 2 -> null
        }

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/sda1" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0c648e382c17f15c1" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }
    }

  # aws_internet_gateway.hashicat will be updated in-place
  ~ resource "aws_internet_gateway" "hashicat" {
        id       = "igw-0696bd5b35b9b7839"
      ~ tags     = {
          ~ "Name" = "stae1102-internet-gateway" -> "DEV-internet-gateway"
        }
      ~ tags_all = {
          ~ "Name"    = "stae1102-internet-gateway" -> "DEV-internet-gateway"
            # (2 unchanged elements hidden)
        }
        # (3 unchanged attributes hidden)
    }

  # aws_key_pair.hashicat must be replaced
-/+ resource "aws_key_pair" "hashicat" {
      ~ arn             = "arn:aws:ec2:ap-northeast-2:156401130715:key-pair/stae1102-ssh-key.pem" -> (known after apply)
      ~ fingerprint     = "32:0f:bd:ab:46:61:9b:1d:df:73:33:b5:49:32:4c:4e" -> (known after apply)
      ~ id              = "stae1102-ssh-key.pem" -> (known after apply)
      ~ key_name        = "stae1102-ssh-key.pem" -> "DEV-ssh-key.pem" # forces replacement
      + key_name_prefix = (known after apply)
      ~ key_pair_id     = "key-0f6e7df9535c17eb8" -> (known after apply)
      ~ key_type        = "rsa" -> (known after apply)
      - tags            = {} -> null
        # (2 unchanged attributes hidden)
    }

  # aws_security_group.hashicat must be replaced
-/+ resource "aws_security_group" "hashicat" {
      ~ arn                    = "arn:aws:ec2:ap-northeast-2:156401130715:security-group/sg-0afc3a656042a8dff" -> (known after apply)
      ~ id                     = "sg-0afc3a656042a8dff" -> (known after apply)
      ~ name                   = "stae1102-security-group" -> "DEV-security-group" # forces replacement
      + name_prefix            = (known after apply)
      ~ owner_id               = "156401130715" -> (known after apply)
      ~ tags                   = {
          ~ "Name" = "stae1102-security-group" -> "DEV-security-group"
        }
      ~ tags_all               = {
          ~ "Name"    = "stae1102-security-group" -> "DEV-security-group"
            # (2 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # aws_subnet.hashicat will be updated in-place
  ~ resource "aws_subnet" "hashicat" {
        id                                             = "subnet-0c9c479fc2ba47a98"
      ~ tags                                           = {
          ~ "name" = "stae1102-subnet" -> "DEV-subnet"
        }
      ~ tags_all                                       = {
          ~ "name"    = "stae1102-subnet" -> "DEV-subnet"
            # (2 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)
    }

  # aws_vpc.hashicat will be updated in-place
  ~ resource "aws_vpc" "hashicat" {
        id                                   = "vpc-08957f3a49972148c"
      ~ tags                                 = {
            "environment" = "Production"
          ~ "name"        = "stae1102-vpc-ap-northeast-2" -> "DEV-vpc-ap-northeast-2"
        }
      ~ tags_all                             = {
          ~ "name"        = "stae1102-vpc-ap-northeast-2" -> "DEV-vpc-ap-northeast-2"
            # (3 unchanged elements hidden)
        }
        # (16 unchanged attributes hidden)
    }

Plan: 4 to add, 4 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
**Pusher**: @stae1102
**Action**: pull_request
